nlshipp/imxrt1060_lcd_arduino/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B1_07 (coord K10), CSI_HSYNC/J35[16]/J22[1]/UART_RX */
#define BOARD_INITPINS_CSI_HSYNC_GPIO                                      GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CSI_HSYNC_PORT                                      GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_CSI_HSYNC_PIN                                         23U   /*!< GPIO1 pin index: 23 */

/* GPIO_AD_B1_06 (coord J12), CSI_VSYNC/J35[18]/J22[2]/UART_TX */
#define BOARD_INITPINS_CSI_VSYNC_GPIO                                      GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CSI_VSYNC_PORT                                      GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_CSI_VSYNC_PIN                                         22U   /*!< GPIO1 pin index: 22 */

/* GPIO_AD_B1_08 (coord H13), AUD_INT/CSI_D9//J35[13]/J22[4] */
#define BOARD_INITPINS_CSI_D9_GPIO                                         GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CSI_D9_PORT                                         GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_CSI_D9_PIN                                            24U   /*!< GPIO1 pin index: 24 */

/* GPIO_AD_B1_02 (coord L11), SPDIF_OUT/J22[7] */
#define BOARD_INITPINS_SPDIF_OUT_GPIO                                      GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_SPDIF_OUT_PORT                                      GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_SPDIF_OUT_PIN                                         18U   /*!< GPIO1 pin index: 18 */

/* GPIO_AD_B1_03 (coord M12), SPDIF_IN/J22[8] */
#define BOARD_INITPINS_SPDIF_IN_GPIO                                       GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_SPDIF_IN_PORT                                       GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_SPDIF_IN_PIN                                          19U   /*!< GPIO1 pin index: 19 */

/* GPIO_AD_B0_09 (coord F14), JTAG_TDI/J21[5]/ENET_RST/J22[5] */
#define BOARD_INITPINS_TDI_GPIO                                            GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_TDI_PORT                                            GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_TDI_PIN                                                9U   /*!< GPIO1 pin index: 9 */

/* GPIO_AD_B0_10 (coord G13), JTAG_TDO/J21[13]/INT1_COMBO/ENET_INT/J22[6]/U32[11] */
#define BOARD_INITPINS_INT1_COMBO_GPIO                                     GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_INT1_COMBO_PORT                                     GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_INT1_COMBO_PIN                                        10U   /*!< GPIO1 pin index: 10 */

/* GPIO_AD_B0_11 (coord G10), JTAG_nTRST/J21[3]/INT2_COMBO/LCD_TOUCH_INT/J22[3]/U32[9] */
#define BOARD_INITPINS_INT2_COMBO_GPIO                                     GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_INT2_COMBO_PORT                                     GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_INT2_COMBO_PIN                                        11U   /*!< GPIO1 pin index: 11 */

/* GPIO_AD_B1_00 (coord J11), I2C1_SCL/CSI_I2C_SCL/J35[20]/J23[6]/U13[17]/U32[4] */
#define BOARD_INITPINS_CSI_I2C_SCL_PERIPHERAL                            FLEXIO3   /*!< Device name: FLEXIO3 */
#define BOARD_INITPINS_CSI_I2C_SCL_SIGNAL                                     IO   /*!< FLEXIO3 signal: IO */
#define BOARD_INITPINS_CSI_I2C_SCL_CHANNEL                                    0U   /*!< FLEXIO3 IO channel: 00 */

/* WAKEUP (coord L6), SD_PWREN */
#define BOARD_INITPINS_SD_PWREN_GPIO                                       GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITPINS_SD_PWREN_PORT                                       GPIO5   /*!< PORT device name: GPIO5 */
#define BOARD_INITPINS_SD_PWREN_PIN                                           0U   /*!< GPIO5 pin index: 0 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
#define BOARD_INITDEBUG_UART_UART1_TXD_PERIPHERAL                        LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITDEBUG_UART_UART1_TXD_SIGNAL                                 TX   /*!< LPUART1 signal: TX */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
#define BOARD_INITDEBUG_UART_UART1_RXD_PERIPHERAL                        LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITDEBUG_UART_UART1_RXD_SIGNAL                                 RX   /*!< LPUART1 signal: RX */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

