nlshipp/imxrt1060_lcd_arduino/board/pin_mux.h
/* GPIO_EMC_09 (coord C2), SEMC_A0 */
#define BOARD_INITSDRAM_SEMC_A0_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A0_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A0_CHANNEL                                       0U   /*!< SEMC ADDR channel: 00 */

/* GPIO_EMC_10 (coord G1), SEMC_A1 */
#define BOARD_INITSDRAM_SEMC_A1_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A1_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A1_CHANNEL                                       1U   /*!< SEMC ADDR channel: 01 */

/* GPIO_EMC_11 (coord G3), SEMC_A2 */
#define BOARD_INITSDRAM_SEMC_A2_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A2_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A2_CHANNEL                                       2U   /*!< SEMC ADDR channel: 02 */

/* GPIO_EMC_12 (coord H1), SEMC_A3 */
#define BOARD_INITSDRAM_SEMC_A3_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A3_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A3_CHANNEL                                       3U   /*!< SEMC ADDR channel: 03 */

/* GPIO_EMC_13 (coord A6), SEMC_A4 */
#define BOARD_INITSDRAM_SEMC_A4_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A4_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A4_CHANNEL                                       4U   /*!< SEMC ADDR channel: 04 */

/* GPIO_EMC_14 (coord B6), SEMC_A5 */
#define BOARD_INITSDRAM_SEMC_A5_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A5_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A5_CHANNEL                                       5U   /*!< SEMC ADDR channel: 05 */

/* GPIO_EMC_15 (coord B1), SEMC_A6 */
#define BOARD_INITSDRAM_SEMC_A6_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A6_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A6_CHANNEL                                       6U   /*!< SEMC ADDR channel: 06 */

/* GPIO_EMC_16 (coord A5), SEMC_A7 */
#define BOARD_INITSDRAM_SEMC_A7_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A7_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A7_CHANNEL                                       7U   /*!< SEMC ADDR channel: 07 */

/* GPIO_EMC_17 (coord A4), SEMC_A8 */
#define BOARD_INITSDRAM_SEMC_A8_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A8_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A8_CHANNEL                                       8U   /*!< SEMC ADDR channel: 08 */

/* GPIO_EMC_18 (coord B2), SEMC_A9 */
#define BOARD_INITSDRAM_SEMC_A9_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A9_SIGNAL                                      ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A9_CHANNEL                                       9U   /*!< SEMC ADDR channel: 09 */

/* GPIO_EMC_23 (coord G2), SEMC_A10 */
#define BOARD_INITSDRAM_SEMC_A10_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A10_SIGNAL                                     ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A10_CHANNEL                                     10U   /*!< SEMC ADDR channel: 10 */

/* GPIO_EMC_19 (coord B4), SEMC_A11 */
#define BOARD_INITSDRAM_SEMC_A11_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A11_SIGNAL                                     ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A11_CHANNEL                                     11U   /*!< SEMC ADDR channel: 11 */

/* GPIO_EMC_20 (coord A3), SEMC_A12 */
#define BOARD_INITSDRAM_SEMC_A12_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_A12_SIGNAL                                     ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAM_SEMC_A12_CHANNEL                                     12U   /*!< SEMC ADDR channel: 12 */

/* GPIO_EMC_21 (coord C1), SEMC_BA0 */
#define BOARD_INITSDRAM_SEMC_BA0_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_BA0_SIGNAL                                       BA   /*!< SEMC signal: BA */
#define BOARD_INITSDRAM_SEMC_BA0_CHANNEL                                      0U   /*!< SEMC BA channel: 0 */

/* GPIO_EMC_22 (coord F1), SEMC_BA1 */
#define BOARD_INITSDRAM_SEMC_BA1_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_BA1_SIGNAL                                       BA   /*!< SEMC signal: BA */
#define BOARD_INITSDRAM_SEMC_BA1_CHANNEL                                      1U   /*!< SEMC BA channel: 1 */

/* GPIO_EMC_24 (coord D3), SEMC_CAS */
#define BOARD_INITSDRAM_SEMC_CAS_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_CAS_SIGNAL                                 semc_cas   /*!< SEMC signal: semc_cas */

/* GPIO_EMC_27 (coord A2), SEMC_CKE */
#define BOARD_INITSDRAM_SEMC_CKE_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_CKE_SIGNAL                                 semc_cke   /*!< SEMC signal: semc_cke */

