nlshipp/imxrt1060_lcd_arduino/board/pin_mux.h
/* GPIO_EMC_26 (coord B3), SEMC_CLK */
#define BOARD_INITSDRAM_SEMC_CLK_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_CLK_SIGNAL                                 semc_clk   /*!< SEMC signal: semc_clk */

/* GPIO_EMC_00 (coord E3), SEMC_D0 */
#define BOARD_INITSDRAM_SEMC_D0_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D0_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D0_CHANNEL                                       0U   /*!< SEMC DATA channel: 00 */

/* GPIO_EMC_01 (coord F3), SEMC_D1 */
#define BOARD_INITSDRAM_SEMC_D1_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D1_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D1_CHANNEL                                       1U   /*!< SEMC DATA channel: 01 */

/* GPIO_EMC_02 (coord F4), SEMC_D2 */
#define BOARD_INITSDRAM_SEMC_D2_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D2_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D2_CHANNEL                                       2U   /*!< SEMC DATA channel: 02 */

/* GPIO_EMC_03 (coord G4), SEMC_D3 */
#define BOARD_INITSDRAM_SEMC_D3_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D3_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D3_CHANNEL                                       3U   /*!< SEMC DATA channel: 03 */

/* GPIO_EMC_04 (coord F2), SEMC_D4 */
#define BOARD_INITSDRAM_SEMC_D4_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D4_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D4_CHANNEL                                       4U   /*!< SEMC DATA channel: 04 */

/* GPIO_EMC_05 (coord G5), SEMC_D5 */
#define BOARD_INITSDRAM_SEMC_D5_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D5_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D5_CHANNEL                                       5U   /*!< SEMC DATA channel: 05 */

/* GPIO_EMC_06 (coord H5), SEMC_D6 */
#define BOARD_INITSDRAM_SEMC_D6_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D6_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D6_CHANNEL                                       6U   /*!< SEMC DATA channel: 06 */

/* GPIO_EMC_07 (coord H4), SEMC_D7 */
#define BOARD_INITSDRAM_SEMC_D7_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D7_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D7_CHANNEL                                       7U   /*!< SEMC DATA channel: 07 */

/* GPIO_EMC_30 (coord C6), SEMC_D8 */
#define BOARD_INITSDRAM_SEMC_D8_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D8_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D8_CHANNEL                                       8U   /*!< SEMC DATA channel: 08 */

/* GPIO_EMC_31 (coord C5), SEMC_D9 */
#define BOARD_INITSDRAM_SEMC_D9_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D9_SIGNAL                                      DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D9_CHANNEL                                       9U   /*!< SEMC DATA channel: 09 */

/* GPIO_EMC_32 (coord D5), SEMC_D10 */
#define BOARD_INITSDRAM_SEMC_D10_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D10_SIGNAL                                     DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D10_CHANNEL                                     10U   /*!< SEMC DATA channel: 10 */

/* GPIO_EMC_33 (coord C4), SEMC_D11 */
#define BOARD_INITSDRAM_SEMC_D11_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D11_SIGNAL                                     DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D11_CHANNEL                                     11U   /*!< SEMC DATA channel: 11 */

/* GPIO_EMC_34 (coord D4), SEMC_D12 */
#define BOARD_INITSDRAM_SEMC_D12_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D12_SIGNAL                                     DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D12_CHANNEL                                     12U   /*!< SEMC DATA channel: 12 */

/* GPIO_EMC_35 (coord E5), SEMC_D13 */
#define BOARD_INITSDRAM_SEMC_D13_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D13_SIGNAL                                     DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D13_CHANNEL                                     13U   /*!< SEMC DATA channel: 13 */

/* GPIO_EMC_36 (coord C3), SEMC_D14 */
#define BOARD_INITSDRAM_SEMC_D14_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D14_SIGNAL                                     DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D14_CHANNEL                                     14U   /*!< SEMC DATA channel: 14 */

/* GPIO_EMC_37 (coord E4), SEMC_D15 */
#define BOARD_INITSDRAM_SEMC_D15_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_D15_SIGNAL                                     DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAM_SEMC_D15_CHANNEL                                     15U   /*!< SEMC DATA channel: 15 */

/* GPIO_EMC_08 (coord H3), SEMC_DM0 */
#define BOARD_INITSDRAM_SEMC_DM0_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_DM0_SIGNAL                                       DM   /*!< SEMC signal: DM */
#define BOARD_INITSDRAM_SEMC_DM0_CHANNEL                                      0U   /*!< SEMC DM channel: 0 */

/* GPIO_EMC_38 (coord D6), SEMC_DM1 */
#define BOARD_INITSDRAM_SEMC_DM1_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_DM1_SIGNAL                                       DM   /*!< SEMC signal: DM */
#define BOARD_INITSDRAM_SEMC_DM1_CHANNEL                                      1U   /*!< SEMC DM channel: 1 */

