nlshipp/imxrt1060_lcd_arduino/board/pin_mux.h
/* GPIO_EMC_25 (coord D2), SEMC_RAS */
#define BOARD_INITSDRAM_SEMC_RAS_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_RAS_SIGNAL                                 semc_ras   /*!< SEMC signal: semc_ras */

/* GPIO_EMC_28 (coord D1), SEMC_WE */
#define BOARD_INITSDRAM_SEMC_WE_PERIPHERAL                                  SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_WE_SIGNAL                                   semc_we   /*!< SEMC signal: semc_we */

/* GPIO_EMC_39 (coord B7), SEMC_DQS */
#define BOARD_INITSDRAM_SEMC_DQS_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_DQS_SIGNAL                                 semc_dqs   /*!< SEMC signal: semc_dqs */

/* GPIO_EMC_29 (coord E1), SEMC_CS0 */
#define BOARD_INITSDRAM_SEMC_CS0_PERIPHERAL                                 SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAM_SEMC_CS0_SIGNAL                                       CS   /*!< SEMC signal: CS */
#define BOARD_INITSDRAM_SEMC_CS0_CHANNEL                                      0U   /*!< SEMC CS channel: 0 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAM(void);

/* GPIO_EMC_40 (coord A7), ENET_MDC */
#define BOARD_INITENET_ENET_MDC_PERIPHERAL                                  ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_MDC_SIGNAL                                  enet_mdc   /*!< ENET signal: enet_mdc */

/* GPIO_EMC_41 (coord C7), ENET_MDIO */
#define BOARD_INITENET_ENET_MDIO_PERIPHERAL                                 ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_MDIO_SIGNAL                                enet_mdio   /*!< ENET signal: enet_mdio */

/* GPIO_B1_10 (coord B13), ENET_TX_CLK */
#define BOARD_INITENET_ENET_TX_CLK_PERIPHERAL                               ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_TX_CLK_SIGNAL                           enet_ref_clk   /*!< ENET signal: enet_ref_clk */

/* GPIO_B1_04 (coord E12), ENET_RXD0 */
#define BOARD_INITENET_ENET_RXD0_PERIPHERAL                                 ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_RXD0_SIGNAL                             enet_rx_data   /*!< ENET signal: enet_rx_data */
#define BOARD_INITENET_ENET_RXD0_CHANNEL                                      0U   /*!< ENET enet_rx_data channel: 0 */

/* GPIO_B1_05 (coord D12), ENET_RXD1 */
#define BOARD_INITENET_ENET_RXD1_PERIPHERAL                                 ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_RXD1_SIGNAL                             enet_rx_data   /*!< ENET signal: enet_rx_data */
#define BOARD_INITENET_ENET_RXD1_CHANNEL                                      1U   /*!< ENET enet_rx_data channel: 1 */

/* GPIO_B1_06 (coord C12), ENET_CRS_DV */
#define BOARD_INITENET_ENET_CRS_DV_PERIPHERAL                               ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_CRS_DV_SIGNAL                             enet_rx_en   /*!< ENET signal: enet_rx_en */

/* GPIO_B1_11 (coord C13), ENET_RXER */
#define BOARD_INITENET_ENET_RXER_PERIPHERAL                                 ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_RXER_SIGNAL                               enet_rx_er   /*!< ENET signal: enet_rx_er */

/* GPIO_B1_07 (coord B12), ENET_TXD0 */
#define BOARD_INITENET_ENET_TXD0_PERIPHERAL                                 ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_TXD0_SIGNAL                             enet_tx_data   /*!< ENET signal: enet_tx_data */
#define BOARD_INITENET_ENET_TXD0_CHANNEL                                      0U   /*!< ENET enet_tx_data channel: 0 */

/* GPIO_B1_08 (coord A12), ENET_TXD1 */
#define BOARD_INITENET_ENET_TXD1_PERIPHERAL                                 ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_TXD1_SIGNAL                             enet_tx_data   /*!< ENET signal: enet_tx_data */
#define BOARD_INITENET_ENET_TXD1_CHANNEL                                      1U   /*!< ENET enet_tx_data channel: 1 */

/* GPIO_B1_09 (coord A13), ENET_TXEN */
#define BOARD_INITENET_ENET_TXEN_PERIPHERAL                                 ENET   /*!< Device name: ENET */
#define BOARD_INITENET_ENET_TXEN_SIGNAL                               enet_tx_en   /*!< ENET signal: enet_tx_en */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENET(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
